app/views/languages/index.html.erb

    <label>Language</label>
    <%= collection_select :language, :Langopt_id, Langopt.all, :id, :name %>
---
SELECT "langopts".* FROM "langopts"