app/controllers/comments_controller.rb

  def create
    if params[:comment][:parent_id].to_i > 0
      parent = Comment.find_by_id(params[:comment].delete(:parent_id))
      @comment = parent.children.build(comment_params)
    else
      @comment = Comment.new(comment_params)
    end

    if @comment.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."parent_id" = ?  ORDER BY created_at DESC  [["parent_id", 1]]
INSERT INTO "comments" ("title", "body", "author", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "My reply"], ["body", "Even I think so"], ["author", "rss@upenn.edu"], ["parent_id", 1], ["created_at", "2016-11-27 22:00:31.928552"], ["updated_at", "2016-11-27 22:00:31.928552"]]