app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT "comments".* FROM "comments" INNER JOIN (