app/controllers/favorites_controller.rb

	def index
		@fav = UserFavorite.where(user_id: current_user.id)
---
SELECT "user_favorites".* FROM "user_favorites" WHERE "user_favorites"."user_id" = ?  [["user_id", 1]]

	def add
		if (params[:type])
			UserFavorite.where(user_id: current_user.id, url: params[:url]).delete_all
			respond_to do |format|
	       		format.html { redirect_to languages_favorite_path}
			end
		else
			if (params[:url] != '')
				url = params[:url]
				new_url = 'https://www.youtube.com/embed/'+url[-11..-1]+'?controls=1'
				@new = UserFavorite.new(user_id: current_user.id, url: new_url, owner: current_user.email, language: params[:lang])
				respond_to do |format|
				      		if @new.save
---
DELETE FROM "user_favorites" WHERE "user_favorites"."user_id" = ? AND "user_favorites"."url" = ?  [["user_id", 1], ["url", "https://www.youtube.com/embed/Hc7BjYmn9z0?controls=1"]]
INSERT INTO "user_favorites" ("user_id", "url", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["url", "https://www.youtube.com/embed/Hc7BjYmn9z0?controls=1"], ["language", "Mitwa"], ["created_at", "2016-12-02 04:34:17.539217"], ["updated_at", "2016-12-02 04:34:17.539217"]]