app/controllers/feedbacks_controller.rb

INSERT INTO "feedbacks" ("user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["comment", "Thanks"], ["created_at", "2016-12-02 22:13:37.438866"], ["updated_at", "2016-12-02 22:13:37.438866"]]
---
  def create
    @feedback = Feedback.new(user_id: current_user.id , comment: params[:comment])

    respond_to do |format|
      if @feedback.save