app/controllers/java_controller.rb

	def index
		@favorites = Favorite.where(language: 'Java')
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."language" = ?  [["language", "Java"]]