app/controllers/python_controller.rb

	def index
		@favorites = Favorite.where(language: 'Python')
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."language" = ?  [["language", "Python"]]

	def favorite
		if params[:type] == 'favorite'
			if not UserFavorite.exists?(user_id: current_user.id, url: params[:url])
				@favorite = UserFavorite.new(user_id: current_user.id, url: params[:url], owner: params[:owner], language: params[:lang])
				respond_to do |format|
		      		if @favorite.save
		       			 format.html { redirect_to languages_python_path}
					end
				end
			else
				redirect_to languages_python_path
			end
		elsif params[:type] == 'unfavorite'
			UserFavorite.where(user_id: current_user.id, url: params[:url]).delete_all
---
SELECT  1 AS one FROM "user_favorites" WHERE "user_favorites"."user_id" = ? AND "user_favorites"."url" = ? LIMIT 1  [["user_id", 1], ["url", "https://www.youtube.com/embed/N4mEzFDjqtA?controls=1"]]
INSERT INTO "user_favorites" ("user_id", "url", "owner", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "user_favorites" WHERE "user_favorites"."user_id" = ? AND "user_favorites"."url" = ?  [["user_id", 1], ["url", "https://www.youtube.com/embed/N4mEzFDjqtA?controls=1"]]