app/controllers/ruby_controller.rb

	def index
		@favorites = Favorite.where(language: 'Ruby')
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."language" = ?  [["language", "Ruby"]]